In [1]:
import pandas as pd
df = pd.read_csv('G:\Mi unidad\###_ ML Zoomcamp 2024\enape_db_formated.csv')

In [2]:
df.head()

,resident_seq_number,sex,age,school_type,school_grade,finished_grade,em_hw_projects,em_tests,em_multimedia_evidence,em_class_participation,...,ap_depressed,ap_academic_desperation,ap_social_difficulty,ap_no_issues,economic_participation,work_hours,economic_consequences,state_number,period_type,period_number
0,1,male,13,public,primary,True,True,True,False,False,...,False,False,False,False,NaN,NaN,NaN,24,year,6.0
1,2,female,19,public,bachelors,True,True,True,False,False,...,False,False,False,False,studying_other,NaN,NaN,24,year,1.0
2,1,female,8,public,primary,True,True,True,False,False,...,False,True,False,False,NaN,NaN,NaN,22,year,2.0
3,1,male,27,private,bachelors,True,True,True,False,False,...,False,False,False,True,worked_one_hour,25.0,no_consequence,26,quadrimester,2.0
4,2,male,11,private,primary,True,True,True,False,False,...,False,False,False,True,NaN,NaN,NaN,18,year,5.0

In [3]:
df.tail()

,resident_seq_number,sex,age,school_type,school_grade,finished_grade,em_hw_projects,em_tests,em_multimedia_evidence,em_class_participation,...,ap_depressed,ap_academic_desperation,ap_social_difficulty,ap_no_issues,economic_participation,work_hours,economic_consequences,state_number,period_type,period_number
19968,1,female,19,public,bachelors,True,False,True,False,False,...,False,False,False,True,studying_other,NaN,NaN,29,semester,4.0
19969,3,female,23,public,bachelors,True,False,True,False,False,...,False,True,False,False,studying_other,NaN,NaN,29,semester,6.0
19970,4,male,25,public,bachelors,True,False,True,False,False,...,False,False,False,False,studying_other,NaN,NaN,29,semester,6.0
19971,2,female,22,public,bachelors,True,False,True,False,False,...,False,True,False,False,studying_other,NaN,NaN,29,semester,6.0
19972,1,male,11,private,primary,True,False,False,False,False,...,False,False,False,True,NaN,NaN,NaN,28,year,5.0

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19973 entries, 0 to 19972
Data columns (total 42 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   resident_seq_number      19973 non-null  int64
 1   sex                      19973 non-null  object
 2   age                      19973 non-null  int64
 3   school_type              19973 non-null  object
 4   school_grade             19973 non-null  object
 5   finished_grade           19973 non-null  bool
 6   em_hw_projects           19973 non-null  bool
 7   em_tests                 19973 non-null  bool
 8   em_multimedia_evidence   19973 non-null  bool
 9   em_class_participation   19973 non-null  bool
 10  em_class_work            19973 non-null  bool
 11  em_class_attendance      19973 non-null  bool
 12  em_other                 19973 non-null  bool
 13  em_no_evaluation         19973 non-null  bool
 14  et_smartphone            19973 non-null  bool
 15  et_laptop                19973 non-null  bool
 16  et_desktop_pc            19973 non-null  bool
 17  et_tablet                19973 non-null  bool
 18  et_flat_screen           19973 non-null  bool
 19  et_didactic_material     19973 non-null  bool
 20  et_other                 19973 non-null  bool
 21  et_none                  19973 non-null  bool
 22  hr_mother                19973 non-null  bool
 23  hr_father                19973 non-null  bool
 24  hr_female_relative       19973 non-null  bool
 25  hr_male_relative         19973 non-null  bool
 26  hr_female_non_relative   19973 non-null  bool
 27  hr_male_non_relative     19973 non-null  bool
 28  hr_none                  19973 non-null  bool
 29  help_hours               11307 non-null  float64
 30  expected_grade           14428 non-null  object
 31  ap_stressed              19973 non-null  bool
 32  ap_depressed             19973 non-null  bool
 33  ap_academic_desperation  19973 non-null  bool
 34  ap_social_difficulty     19973 non-null  bool
 35  ap_no_issues             19973 non-null  bool
 36  economic_participation   9575 non-null   object
 37  work_hours               2935 non-null   float64
 38  economic_consequences    2935 non-null   object
 39  state_number             19973 non-null  int64
 40  period_type              19973 non-null  object
 41  period_number            19973 non-null  float64
dtypes: bool(29), float64(3), int64(3), object(7)
memory usage: 2.5+ MB

In [5]:
df.shape

(19973, 42)

In [6]:
df.columns

Index(['resident_seq_number', 'sex', 'age', 'school_type', 'school_grade',
       'finished_grade', 'em_hw_projects', 'em_tests',
       'em_multimedia_evidence', 'em_class_participation', 'em_class_work',
       'em_class_attendance', 'em_other', 'em_no_evaluation', 'et_smartphone',
       'et_laptop', 'et_desktop_pc', 'et_tablet', 'et_flat_screen',
       'et_didactic_material', 'et_other', 'et_none', 'hr_mother', 'hr_father',
       'hr_female_relative', 'hr_male_relative', 'hr_female_non_relative',
       'hr_male_non_relative', 'hr_none', 'help_hours', 'expected_grade',
       'ap_stressed', 'ap_depressed', 'ap_academic_desperation',
       'ap_social_difficulty', 'ap_no_issues', 'economic_participation',
       'work_hours', 'economic_consequences', 'state_number', 'period_type',
       'period_number'],
      dtype='object')

In [7]:
df.describe()

,resident_seq_number,age,help_hours,work_hours,state_number,period_number
count,19973.000000,19973.000000,11307.000000,2935.000000,19973.000000,19973.000000
mean,1.818555,13.468883,7.360131,27.848382,17.372553,3.121614
std,0.956192,5.555088,5.977311,16.703084,9.209788,2.139085
min,1.000000,3.000000,0.000000,0.000000,1.000000,1.000000
25%,1.000000,9.000000,4.000000,12.000000,9.000000,2.000000
50%,2.000000,13.000000,5.000000,25.000000,18.000000,3.000000
75%,2.000000,18.000000,10.000000,40.000000,26.000000,4.000000
max,10.000000,29.000000,99.000000,99.000000,32.000000,98.000000

In [8]:
df.describe(include=['object'])

,sex,school_type,school_grade,expected_grade,economic_participation,economic_consequences,period_type
count,19973,19973,19973,14428,9575,2935,19973
unique,2,2,11,9,7,8,6
top,male,public,primary,bachelors,studying_other,no_consequence,year
freq,10231,17826,7172,11187,6482,1431,16109

In [10]:
numerical = list(df.select_dtypes(include=['float64', 'int64']).columns)
categorical = list(df.select_dtypes(include=['object', 'category']).columns)
boolean = list(df.select_dtypes(include=['bool']).columns)

In [11]:
print(numerical)
print(categorical)
print(boolean)

['resident_seq_number', 'age', 'help_hours', 'work_hours', 'state_number', 'period_number']
['sex', 'school_type', 'school_grade', 'expected_grade', 'economic_participation', 'economic_consequences', 'period_type']
['finished_grade', 'em_hw_projects', 'em_tests', 'em_multimedia_evidence', 'em_class_participation', 'em_class_work', 'em_class_attendance', 'em_other', 'em_no_evaluation', 'et_smartphone', 'et_laptop', 'et_desktop_pc', 'et_tablet', 'et_flat_screen', 'et_didactic_material', 'et_other', 'et_none', 'hr_mother', 'hr_father', 'hr_female_relative', 'hr_male_relative', 'hr_female_non_relative', 'hr_male_non_relative', 'hr_none', 'ap_stressed', 'ap_depressed', 'ap_academic_desperation', 'ap_social_difficulty', 'ap_no_issues']

In [13]:
total = len(numerical) + len(categorical) + len(boolean)
total

42